Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.Удержания</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОкладыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ОкладыСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОсновныеНачисленияПриИзмененииНаСервере(Дата, Сотрудник, Подразделение, ВидНачисления)
	
	//если выбран вид начисления Оклад, подставить автоматически размер оклада
	Если ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда		
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("Сотрудник", Сотрудник);
		СтруктураОтбор.Вставить("Подразделение", Подразделение);
		
		Оклад = РегистрыСведений.ОкладыСотрудников.ПолучитьПоследнее(Дата, СтруктураОтбор).Оклад;
		
		Возврат Оклад;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОсновныеНачисленияПриИзменении(Элемент) 
	ТекСтрока = Элементы.ОсновныеНачисления.ТекущиеДанные;                    

	ТекСтрока.Размер = ОсновныеНачисленияПриИзмененииНаСервере(Объект.Дата, ТекСтрока.Сотрудник, Объект.Подразделение, ТекСтрока.ВидНачисления);		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнительныеНачисленияВидНачисленияПриИзмененииНаСервере(ВидНачисления)
	Возврат ВидНачисления = ПланыВидовРасчета.ДополнительныеНачисления.Подарок;	
КонецФункции

&НаКлиенте
Процедура ДополнительныеНачисленияВидНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.ДополнительныеНачисления.ТекущиеДанные; 
	
	ВидНачисленияПодарок = ДополнительныеНачисленияВидНачисленияПриИзмененииНаСервере(ТекСтрока.ВидНачисления);
	
	//если вид начисления подарок - сделать невидимой колонку "Процент" 
	//иначе невидима колонка "Размер
	
	Если ВидНачисленияПодарок Тогда
		
		Элементы.ДополнительныеНачисленияПроцент.Доступность = Ложь;
		Элементы.ДополнительныеНачисленияРазмер.Доступность = Истина;  
		
	Иначе
		Элементы.ДополнительныеНачисленияРазмер.Доступность = Ложь;
		Элементы.ДополнительныеНачисленияПроцент.Доступность = Истина;
		
	КонецЕсли;		
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНДФЛНаСервере()	
	
	//В Удержания внести имена всех сотрудников, у кого есть основные и/или дополнительные начисления за текущий месяц
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НачислениеЗарплатыДополнительныеНачисления.Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.ДополнительныеНачисления КАК НачислениеЗарплатыДополнительныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыДополнительныеНачисления.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 		
		НоваяСтрока = Объект.Удержания.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник; 
		НоваяСтрока.ВидНачисления = ПланыВидовРасчета.Удержания.НДФЛ; 
		НоваяСтрока.Процент = 13;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНДФЛ(Команда) 
	Записать();
	ЗаполнитьНДФЛНаСервере(); 
КонецПроцедуры 


&НаСервереБезКонтекста
Функция УдержанияВидНачисленияПриИзмененииНаСервере(ВидНачисления)
	Если ВидНачисления = ПланыВидовРасчета.Удержания.НДФЛ Тогда  
		Возврат 13;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УдержанияВидНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.Удержания.ТекущиеДанные;
	
	ТекСтрока.Процент = УдержанияВидНачисленияПриИзмененииНаСервере(ТекСтрока.ВидНачисления);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОсн(Команда)
	// Очищаем табличную часть 
	Объект.ОсновныеНачисления.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДоп(Команда)
	Объект.ДополнительныеНачисления.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУдержания(Команда)
	Объект.Удержания.Очистить();
КонецПроцедуры
